docs/posts/2020-05-12-emacs-org-capture.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Org-Capture</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Emacs Org-Capture</h1>
<p class="subtitle" role="doc-subtitle">May 12, 2020</p>
</header><p>
When trying to post to a journal for the first time in an embarrassing number of months, I received an error that I had never had in the past: &ldquo;org-capture-select-template: Symbol’s function definition is void: org-mks.&rdquo; A quick search revealed that it’s clearly defined in org.el, and I was successfully using org mode for other things, so I could see no reason for the error. A Google search revealed that several had the problem, but none of the proposed solutions worked.
</p>

<p>
In the end, it was a problem with my Emacs initialization file. I use an org-mode file, that is bootstrapped with an initialization file that requires org-install and tangle. Moving (package-initialize) to the first line of that file fixed the problem.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
